module.exports = {
  // Максимальная длина строки перед переносом (по умолчанию 80)
  printWidth: 100, // любое положительное число
  // Количество пробелов для отступов (по умолчанию 2)
  tabWidth: 2, // любое положительное число
  // Использовать табуляцию вместо пробелов (по умолчанию false)
  useTabs: false, // true | false
  // Добавлять точку с запятой в конце строк (по умолчанию true)
  semi: false, // true | false
  // Использовать одинарные кавычки вместо двойных для строк (по умолчанию false)
  singleQuote: true, // true | false
  // Использовать одинарные кавычки вместо двойных в JSX (по умолчанию false)
  jsxSingleQuote: false, // true | false
  // Добавлять запятую в конце объектов, массивов и функций (по умолчанию 'none')
  trailingComma: 'none', // 'none' | 'es5' | 'all'
  // Добавлять пробелы между фигурными скобками в объектах (по умолчанию true)
  bracketSpacing: false, // true | false
  // Оборачивать параметры стрелочных функций в круглые скобки (по умолчанию 'avoid')
  arrowParens: 'avoid' // 'avoid' | 'always'
}
